test/wrk2_fission/hotel_reservation/old_results/output_set-hotel-point.log
Running 1m test @ http://130.127.133.207:32001
  1 threads and 1 connections
  Thread calibration: mean lat.: 6652.928ms, rate sampling interval: 16556ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    38.87s    11.59s    0.92m    63.32%
    Req/Sec     4.00      1.63     6.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   41.22s 
 75.000%   48.73s 
 90.000%    0.87m 
 99.000%    0.91m 
 99.900%    0.92m 
 99.990%    0.92m 
 99.999%    0.92m 
100.000%    0.92m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9945.087     0.000000            1         1.00
   21659.647     0.100000           23         1.11
   27951.103     0.200000           46         1.25
   33275.903     0.300000           69         1.43
   37191.679     0.400000           92         1.67
   41222.143     0.500000          115         2.00
   43057.151     0.550000          126         2.22
   44335.103     0.600000          138         2.50
   45416.447     0.650000          149         2.86
   47251.455     0.700000          161         3.33
   48726.015     0.750000          172         4.00
   49184.767     0.775000          178         4.44
   50233.343     0.800000          184         5.00
   50593.791     0.825000          189         5.71
   51314.687     0.850000          195         6.67
   52166.655     0.875000          201         8.00
   52330.495     0.887500          204         8.89
   52527.103     0.900000          207        10.00
   52723.711     0.912500          209        11.43
   53084.159     0.925000          212        13.33
   53772.287     0.937500          215        16.00
   53870.591     0.943750          217        17.78
   53936.127     0.950000          218        20.00
   53968.895     0.956250          219        22.86
   54132.735     0.962500          221        26.67
   54231.039     0.968750          223        32.00
   54231.039     0.971875          223        35.56
   54394.879     0.975000          224        40.00
   54394.879     0.978125          224        45.71
   54460.415     0.981250          225        53.33
   54525.951     0.984375          226        64.00
   54525.951     0.985938          226        71.11
   54788.095     0.987500          228        80.00
   54788.095     0.989062          228        91.43
   54788.095     0.990625          228       106.67
   54788.095     0.992188          228       128.00
   54788.095     0.992969          228       142.22
   54788.095     0.993750          228       160.00
   54788.095     0.994531          228       182.86
   54788.095     0.995313          228       213.33
   55345.151     0.996094          229       256.00
   55345.151     1.000000          229          inf
#[Mean    =    38873.866, StdDeviation   =    11588.279]
#[Max     =    55312.384, Total count    =          229]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  108.80ms
 75.000%  264.96ms
 90.000%  527.36ms
 99.000%    1.65s 
 99.900%    1.68s 
 99.990%    1.68s 
 99.999%    1.68s 
100.000%    1.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      36.703     0.000000            1         1.00
      45.983     0.100000           23         1.11
      59.103     0.200000           46         1.25
      80.831     0.300000           69         1.43
      97.535     0.400000           92         1.67
     108.799     0.500000          115         2.00
     121.407     0.550000          126         2.22
     162.943     0.600000          138         2.50
     198.783     0.650000          149         2.86
     216.191     0.700000          161         3.33
     264.959     0.750000          172         4.00
     296.959     0.775000          178         4.44
     353.791     0.800000          184         5.00
     374.015     0.825000          189         5.71
     483.327     0.850000          195         6.67
     502.783     0.875000          201         8.00
     525.311     0.887500          204         8.89
     531.967     0.900000          207        10.00
     534.015     0.912500          209        11.43
     537.087     0.925000          212        13.33
     549.887     0.937500          215        16.00
     561.151     0.943750          217        17.78
     563.199     0.950000          218        20.00
     564.735     0.956250          219        22.86
     772.095     0.962500          221        26.67
     854.527     0.968750          222        32.00
     858.111     0.971875          223        35.56
     886.783     0.975000          224        40.00
     886.783     0.978125          224        45.71
    1366.015     0.981250          225        53.33
    1369.087     0.984375          226        64.00
    1369.087     0.985938          226        71.11
    1651.711     0.987500          227        80.00
    1651.711     0.989062          227        91.43
    1651.711     0.990625          227       106.67
    1665.023     0.992188          228       128.00
    1665.023     0.992969          228       142.22
    1665.023     0.993750          228       160.00
    1665.023     0.994531          228       182.86
    1665.023     0.995313          228       213.33
    1680.383     0.996094          229       256.00
    1680.383     1.000000          229          inf
#[Mean    =      223.436, StdDeviation   =      267.383]
#[Max     =     1679.360, Total count    =          229]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  233 requests in 1.00m, 108.99KB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:      3.88
Transfer/sec:      1.82KB